<a href="https://colab.research.google.com/github/SanjayGorurUT/nlp-stock-search/blob/main/lec2_activity.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lec2 Activity, CS6400 A
Please **MAKE A COPY** of this notebook from the menu File > Save a copy in Drive. You are expected to work on your own copy during class.

## Setup (single-table queries)

To work with SQL easily in an Ipython notebook, we'll load the [ipython-sql extension](https://github.com/catherinedevlin/ipython-sql) as follows:

In [ ]:
%load_ext sql
%sql sqlite://
# This is the key setting to disable the fancy table output
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

Using the syntax we just learned, let's create your first table in SQL!

In [ ]:
%%sql
drop table if exists product;
create table product(
       pname varchar, -- name of the product
       price float, -- price of the product
       category varchar, -- category
       manufacturer varchar, -- manufacturer
       primary key (pname, manufacturer));

 * sqlite://
Done.
Done.

[]

And insert some rows into the tables

In [ ]:
%%sql
insert into product values('Pikachu', 19.99, 'Toy', 'ToyWorks');
insert into product values('Pikachu', 19.99, 'Toy', 'ToyFriends');
insert into product values('Pokeball', 29.99, 'Electronic', 'ToyCo');
insert into product values('Bulbasaur', 149.99, 'Toy', 'ToyFriends');
insert into product values('Charizard', 203.99, 'Toy', 'ToyCo');
insert into product values('PokeCamera', 19.99, 'Electronic', 'ToyWorks');
insert into product values('Pokemon Cards', NULL, 'Games', 'ToyCo');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Let's check out the table we just created.

In [ ]:
%sql select * from product;

 * sqlite://
Done.

[('Pikachu', 19.99, 'Toy', 'ToyWorks'),
 ('Pikachu', 19.99, 'Toy', 'ToyFriends'),
 ('Pokeball', 29.99, 'Electronic', 'ToyCo'),
 ('Bulbasaur', 149.99, 'Toy', 'ToyFriends'),
 ('Charizard', 203.99, 'Toy', 'ToyCo'),
 ('PokeCamera', 19.99, 'Electronic', 'ToyWorks'),
 ('Pokemon Cards', None, 'Games', 'ToyCo')]

###Q1
Write a query that returns names of all products whose price is under 20.

In [ ]:
%%sql
--TODO

 * sqlite://
Done.

[('Pikachu',), ('Pikachu',), ('PokeCamera',)]

###Q2
Write a query to get an output table of all the products with "Poke" in the name, showing just their name and price, and sorted alphabetically by manufacturer.

In [ ]:
%%sql
--TODO

 * sqlite://
Done.

[('Pokeball', 29.99), ('PokeCamera', 19.99)]

## Setup (multi-table queries)

Let's try working with mulitple tables. We will create the following two tables:
> Product (<u>pname</u>, price, category,  <u>manufacturer</u>)<br>
> Company (<u>cname</u>, stockPrice, country)

In [ ]:
%%sql
drop table if exists company;
pragma foreign_keys = ON; -- WARNING by default off in sqlite
create table company (
    cname varchar primary key, -- company name uniquely identifies the company.
    stockprice float, -- stock price is in float
    country varchar); -- country is just a string
insert into company values ('ToyWorks', 25.0, 'USA');
insert into company values ('ToyFriends', 65.0, 'China');
insert into company values ('ToyCo', 15.0, 'China');

 * sqlite://
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
-- Let's recreate the product table, this time with a foreign key constraint
drop table if exists product;
create table product(
       pname varchar, -- name of the product
       price money, -- price of the product
       category varchar, -- category
       manufacturer varchar, -- manufacturer
       primary key (pname, manufacturer),
       foreign key (manufacturer) references company(cname));
insert into product values('Pikachu', 19.99, 'Toy', 'ToyWorks');
insert into product values('Pikachu', 19.99, 'Toy', 'ToyFriends');
insert into product values('Pokeball', 29.99, 'Electronic', 'ToyCo');
insert into product values('Bulbasaur', 149.99, 'Toy', 'ToyFriends');
insert into product values('Charizard', 203.99, 'Toy', 'ToyCo');
insert into product values('PokeCamera', 19.99, 'Electronic', 'ToyWorks');

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Q3
Write a query to find all categories of products that are made by Chinese companies.
> Product (<u>pname</u>, price, category,  <u>manufacturer</u>)<br>
> Company (<u>cname</u>, stockPrice, country)

In [ ]:
%%sql
--TODO

 * sqlite://
Done.

[('Toy',), ('Electronic',)]